
$(function(){
	$(".navbar-toggler, .close").click(function(){
		$(".menu-collapse").toggleClass("collapsed");
	})
})

let miData = [
	{
		"Модель":"Xiaomi MI Mix 2",
		"Вес":"185г",
		"Процессор":"Qualcomm Snapdragon 835",
		"Тип экрана":"IPS LCD",
		"Размер экрана":"5,99",
		"Разрешение экрана":"2160x1080",
		"Видеопроцессор":"Adreno 540",
		"Фронтальная камера":"5 МП",
		"Объем оперативной памяти":"6 Гб",
		"Объем встроенной памяти":"64 Гб",
		"Тыловая фотокамера":"12 МП",
		"Диафрагма":"F/2.2",
		"Макс. разрешение видео":"3840x2160 (4K)",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"6",
		"price":"200.000тг",
		"file":"./media/Mix2.jpg"
	},
	{
		"Модель":"Xiaomi MI Note 2",
		"Вес":"166г",
		"Процессор":"Qualcomm Snapdragon 821",
		"Тип экрана":"OLED",
		"Размер экрана":"5,7",
		"Разрешение экрана":"1920*1080",
		"Видеопроцессор":"Adreno 530",
		"Фронтальная камера":"8 МП",
		"Объем оперативной памяти":"6 Гб",
		"Объем встроенной памяти":"128 Гб",
		"Тыловая фотокамера":"22 МП",
		"Диафрагма":"F/2",
		"Макс. разрешение видео":"3840x2160 (4K)",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"8",
		"price":"132.000тг",
		"file":"./media/MiNote2.jpg"
	},
	{
		"Модель":"Redmi Note 5",
		"Вес":"181г",
		"Процессор":"Qualcomm Snapdragon 836",
		"Тип экрана":"IPS",
		"Размер экрана":"5,99",
		"Разрешение экрана":"2160х1080",
		"Видеопроцессор":"Adreno 509",
		"Фронтальная камера":"13 МП",
		"Объем оперативной памяти":"6 Гб",
		"Объем встроенной памяти":"128 Гб",
		"Тыловая фотокамера":"12+5 МП",
		"Диафрагма":"F/2",
		"Макс. разрешение видео":"3840x2160 (4K)",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"11",
		"price":"93.000тг",
		"file":"./media/MiNote5.jpg"
	},
	{
		"Модель":"Redmi Note 4",
		"Вес":"165г",
		"Процессор":"Qualcomm Snapdragon 625",
		"Тип экрана":"IPS",
		"Размер экрана":"5,5",
		"Разрешение экрана":"1920*1080",
		"Видеопроцессор":"Adreno 506",
		"Фронтальная камера":"5 МП",
		"Объем оперативной памяти":"4 Гб",
		"Объем встроенной памяти":"64 Гб",
		"Тыловая фотокамера":"13 МП",
		"Диафрагма":"F/2.2",
		"Макс. разрешение видео":"1920*1080",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"3",
		"price":"62.000тг",
		"file":"./media/MiNote4.jpg"
	},
	{
		"Модель":"Xiaomi Mi A1",
		"Вес":"165г",
		"Процессор":"Qualcomm Snapdragon 625",
		"Тип экрана":"IPS",
		"Размер экрана":"5,5",
		"Разрешение экрана":"1920*1080",
		"Видеопроцессор":"Adreno 506",
		"Фронтальная камера":"5 МП",
		"Объем оперативной памяти":"4 Гб",
		"Объем встроенной памяти":"64 Гб",
		"Тыловая фотокамера":"12+12 МП",
		"Диафрагма":"F/2.2",
		"Макс. разрешение видео":"3840x2160 (4K)",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"5",
		"price":"68.000тг",
		"file":"./media/MiA1.jpg"
	},
	{
		"Модель":"Xiaomi Redmi 5 Plus",
		"Вес":"180г",
		"Процессор":"Qualcomm Snapdragon 625",
		"Тип экрана":"IPS",
		"Размер экрана":"5,99",
		"Разрешение экрана":"2160х1080",
		"Видеопроцессор":"Adreno 506",
		"Фронтальная камера":"5 МП",
		"Объем оперативной памяти":"4 Гб",
		"Объем встроенной памяти":"64 Гб",
		"Тыловая фотокамера":"12 МП",
		"Диафрагма":"F/2.2",
		"Макс. разрешение видео":"1920*1080",
		"Интерфейсы":"Wi-Fi 802.11ac, Wi-Fi Direct, Bluetooth 5.0, IRDA, USB, NFC",
		"count":"13",
		"price":"77.000тг",
		"file":"./media/MiPlus5.jpg"
	}
];

let vm = new Vue({
	el: "#app",
	data:{
		miData: miData,
		shoppingCart:{
			count: 2,
			items: '',
			price: 54524
		}
	}
});